<template>
    <div>
        <div class="page-shadow" @click="$store.commit('closePrivacyPolicy'); $router.back()" v-if="$store.getters.getPrivacyPolicy">
          <div class="pop-up main" @click="stopPropag" v-if="$store.getters.getPrivacyPolicy">
            <span class="close-btn" @click="$store.commit('closePrivacyPolicy'); $router.back()">&times;</span>
            <p style="text-align: center;">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</p>
            <p>Редакция 1.0
                <br />Документ опубликован 01.06.2022</p>
            <p>1.&emsp;ПРЕДМЕТ. ПРИМЕНЕНИЕ</p>
            <p>1.1.&emsp;Настоящая Политика конфиденциальности (далее — «<b>Политика</b>» ) регулирует условия защиты персональных данных на нашем веб-сайте, расположенном по адресу <span @click="$store.commit('closePrivacyPolicy')"><router-link class="inside-footer-text" to="/">https://skyeng.ru</router-link></span> («<b>Сайт</b>»), в мобильном приложении FullEng, а также у инструментов, с помощью которых мы предоставляем вам либо вы предоставляете нам услуги (далее совместно именуются «<b>Услуги</b>» или «<b>Сайт</b>»).</p>
            <p>1.2.&emsp;Политика является юридическим документом, в котором разъясняется, каким образом <b>Индивидуальный предприниматель Дмитрягина К. Н.</b> (далее также именуемый — «<b>Компания</b>» или «<b>мы</b>»), собирает, хранит, обрабатывает и передаёт данные о вас, которые мы получаем, когда вы получаете доступ к Сайту или используете его («<b>Персональные данные</b>»).</p>
            <p>1.3.&emsp;Пользуясь какой-либо Услугой либо оказывая какую-либо Услугу, вы соглашаетесь с Политикой и принимаете её в полном объёме.</p>
            <p>1.4.&emsp;Просим вас внимательно ознакомиться с Политикой, это поможет вам понять область её применения и принять осознанное решение о предоставлении нам ваших Персональных данных.</p>                
            <p>2.&emsp;КАКУЮ ИНФОРМАЦИЮ МЫ СОБИРАЕМ</p>
            <p>2.1.&emsp;Мы собираем несколько типов Персональных данных в различных целях, связанных с предоставлением вам либо получением нами Услуг и повышением их качества:</p>
            <p style="padding: 0;">2.1.1.&emsp;<b>Информация, которую вы нам предоставляете</b>. Вы предоставляете её, когда заполняете некоторые формы на Сайте, или общаетесь с нами, например, по электронной почте, телефону, в мессенджерах или социальных сетях. В неё включается информация, которую вы предоставляете нам при регистрации для использования Сайта. Когда вы пишете или звоните нам, мы ведём запись таких сообщений.</p>
            <p style="padding: 0;">2.1.2.&emsp;<b>Информация, которая собирается автоматически</b>. Мы собираем определенную информацию автоматически, когда вы посещаете, используете Сайт или перемещаетесь по нему. Эта информация нужна нам для поддержания безопасности и обеспечения бесперебойной работы Сайта, а также для анализа данных и отчётности.
                <br />&emsp;&emsp;&emsp;Эта информация может включать сведения о компьютере или мобильном устройстве и их использовании. Примеры такой информации: информация об устройстве, протокол IP, тип и версия браузера, операционная система, языковые настройки, информация о мобильной сети, операционная система мобильного телефона, тип и версия браузера мобильного устройства, текущее местоположение, ссылки в формате URL, информация об использовании: например, время входа на Сайт и выхода, какие страницы вы посещаете и какие функции используете, техническая информация, указанная на Сайте, например, информация о скорости доступа в Интернет («<b>Данные об использовании</b>»).</p>
            <p style="padding: 0;">2.1.3.&emsp;<b>Данные, которые мы можем собирать у третьих лиц</b>. Мы можем получать данные о вас из других источников, в том числе от третьих лиц, которые помогают нам обновлять, расширять и анализировать имеющиеся у нас данные; предотвращать или выявлять случаи мошенничества; обрабатывать платежи; или анализировать, как вы используете Услуги («<b>Данные от третьих лиц</b>»).</p>
            <p>2.1.4.&emsp;Информация, которую мы собираем, служит определённым целям, таким как использование Услуг и (или) операционные цели Компании. Компания обязуется не использовать никакую собранную информацию для целей, которые не соответствуют или отличаются от целей, в которых информация была запрошена.</p>
            <p>3.&emsp;ИСПОЛЬЗОВАНИЕ ДАННЫХ</p>
            <p>3.1.&emsp;Мы используем личную информацию, которую собираем через Сайт и (или) любое из средств, описанных в пункте 2.1.1, для следующих целей:</p>
            <p style="padding: 0;">3.1.1.&emsp;когда это необходимо для наших законных деловых интересов; и (или)</p>
            <p style="padding: 0;">3.1.2.&emsp;с целью заключения с вами договора на использование Сайта или его исполнения; и (или)</p>
            <p style="padding: 0;">3.1.3.&emsp;для нашей обычной финансово-хозяйственной деятельности; и (или)</p>
            <p style="padding: 0;">3.1.4.&emsp;когда вы дали согласие на обработку информации; и (или)</p>
            <p style="padding: 0;">3.1.5.&emsp;с целью соблюдения своих юридических обязательств; и (или)</p>
            <p>3.1.6.&emsp;с целью защиты своих законных прав и исполнения судебных и (или) административных распоряжений, если необходимо.</p>
            <p>4.&emsp;КОГДА МЫ РАСКРЫВАЕМ ИНФОРМАЦИЮ ТРЕТЬИМ ЛИЦАМ</p>
            <p>4.1.&emsp;Мы делимся информацией только в следующих случаях:</p>
            <p style="padding: 0;">4.1.1.&emsp;по требованию законодательства;</p>
            <p style="padding: 0;">4.1.2.&emsp;с целью защитить ваши права;</p>
            <p style="padding: 0;">4.1.3.&emsp;с целью выполнения деловых обязательств (например, если для предоставления вам Услуг необходимо привлечь третье лицо);</p>
            <p>4.1.4.&emsp;если вы даёте нам своё согласие.</p>
            <p>4.2.&emsp;Принимая Политику, вы соглашаетесь с тем, что мы вправе раскрывать информацию о вас только:</p>
            <p style="padding: 0;">4.2.1.&emsp;<b>по требованию законодательства</b>. Мы вправе раскрывать информацию о вас в тех случаях, когда обязаны это сделать в соответствии с действующим законодательством, запросами государственных органов, судебным разбирательством, постановлением суда или судебным процессом. Например, мы вправе раскрыть информацию в ответ на постановление суда, повестку в суд, запрос органов государственной власти о выполнении требований национальной безопасности или правоохранительных органов. Мы также вправе раскрывать информацию о вас, когда проводим расследование или сотрудничаем в расследовании мошенничества или другой незаконной деятельности с целью предотвращения и обнаружения мошенничества или другого преступления;</p>
            <p style="padding: 0;">4.2.2.&emsp;<b>с тем, чтобы позволить третьим лицам оказывать услуги</b>. Мы вправе передавать ваши данные деловым партнерам, поставщикам услуг, подрядчикам или агентам, предоставляющим услуги нам или от нашего имени и требующим доступа к такой информации с целью выполнения обязательств. Примеры таких услуг третьих лиц: обработка платежей, анализ данных, доставка электронной почты, хостинг, обслуживание клиентов, предоставление нам доступа к базам данных по борьбе с мошенничеством, проверка. Мы вправе разрешить отдельным третьим лицам использовать на Сайте технологию отслеживания, что позволит им собирать данные о том, как вы взаимодействуете с Сайтом с течением времени. Мы также вправе делиться информацией о вас с нашими аффилированными лицами. К аффилированным лица относятся наши материнские компании и любые дочерние компании, партнёры по совместным предприятиям или другие члены нашей группы компаний. Наши аффилированные лица, партнёры и подрядчики также должны будут соответствовать нашим стандартам в части обработки данных и безопасности;</p>
            <p style="padding: 0;">4.2.3.&emsp;<b>при передаче бизнеса</b>. Мы вправе раскрывать или передавать ваши данные в связи с любым слиянием, продажей активов компании, финансировании или приобретении всего или части нашего бизнеса другой компанией, или во время переговоров о чём-либо из перечисленного. Мы обязуемся уведомить вас до того, как ваши личные данные будут переданы и станут предметом другой политики конфиденциальности;</p>
            <p>4.2.4.&emsp;<b>если вы дали согласие</b>. Мы вправе раскрыть ваши Персональные данные в иных целях, описанных в разделе 5, если вы дадите нам своё согласие на это.</p>
            <p>5.&emsp;С КЕМ МЫ ДЕЛИМСЯ ИНФОРМАЦИЕЙ</p>
            <p>5.1.&emsp;Компетентные органы:</p>
            <p style="padding: 0;">5.1.1.&emsp;По запросу, а также в случаях, описанных в пункте 4.2.1.</p>
            <p>5.1.2.&emsp;Для разрешения любого конфликта или спора, возникающего в отношениях между пользователями и Компанией.</p>
            <p>5.2.&emsp;Поставщики услуг по выставлению счетов и приёму платежей:</p>
            <p style="padding: 0;">5.2.1.&emsp;Мы передаём и раскрываем Предоставленные данные, включая номер и (или) дату выдачи документа, удостоверяющего личность, его копии (например, паспорта), Поставщикам услуг по выставлению счетов и приёму платежей.</p>
            <p style="padding: 0;">5.2.2.&emsp;Мы передаём и раскрываем Предоставленные данные Поставщикам услуг по выставлению счетов и приёму платежей только в том случае, если они их запрашивают. Если вы не используете Поставщиков услуг по выставлению счетов и приёму платежей на Сайте, мы не будем делиться с ними Предоставленными данными.</p>
            <p>5.2.3.&emsp;Мы не собираем и не храним данные вашей банковской карты. Вы предоставляете эту информацию нашим Поставщикам услуг по выставлению счетов и приёму платежей. То, как они используют Предоставленные данные для обработки платежей, регулируется их политикой конфиденциальности.</p>
            <p>5.3.&emsp;Поставщики услуг по хранению данных:
                <br />&emsp;&emsp;&ensp;Мы храним данные на наших защищённых серверах в России.</p>
            <p>5.4.&emsp;Рекламные платформы и приложения:
                <br />&emsp;&emsp;&ensp;Платформы, которые мы используем для рекламы, позволяют нам оптимизировать и демонстрировать рекламные объявления, исходя из данных об использовании Сайта, т. е. отслеживая данные об использовании и файлы cookie.</p>
            <p>5.5.&emsp;Маркетинговые и аналитические платформы:
                <br />&emsp;&emsp;&ensp;Мы передаём и раскрываем ваши файлы cookie и данные об использовании в целях веб-аналитики и мобильной аналитики, а также с целью персонализации контента на Сайте: например, чтобы предлагать вам не все наши услуги, а только те, которые могут вас заинтересовать.</p>
            <p>5.6.&emsp;Поставщики вспомогательного программного обеспечения;
                <br />&emsp;&emsp;&ensp;С целью организации службы поддержки клиентов (общение с нашими клиентами и с заинтересованными лицами и ответы на их вопросы и просьбы) мы передаём и раскрываем Предоставленные данные (в т. ч. имя, фамилию, номер телефона, адрес электронной почты, пол, местоположение и профили в социальных сетях) поставщикам вспомогательного программного обеспечения, в частности поставщикам CRM.</p>
            <p>6.&emsp;ИСПОЛЬЗОВАНИЕ ФАЙЛОВ COOKIE</p>
            <p>6.1.&emsp;Как мы используем файлы cookie</p>
            <p style="padding: 0;">6.1.1.&emsp;Мы используем файлы cookie, чтобы отличать вас от других пользователей Сайта. Это помогает нам улучшить ваш опыт и сам Сайт: мы сохраняем ваши предпочтения и анализируем то, как вы используете Сайт.</p>
            <p style="padding: 0;">6.1.2.&emsp;Файл cookie — это небольшой фрагмент текста, который сохраняется в вашем браузере при посещении Сайта. Наш Сайт передаёт файлы cookie вашему браузеру; ваше устройство их сохраняет. Каждому устройству, с которого вы заходите на Платформу, мы присваиваем отдельный файл cookie. Использование файлов cookie не даёт нам доступа к каким-то другим данным на вашем устройстве, кроме данных, сохраненных в файле cookie. Файлы cookie, которые мы собираем, не содержат ваших личных данных, таких как имя или адрес.</p>
            <p style="padding: 0;">6.1.3.&emsp;Файлы cookie хранятся бессрочно, а не только в течение сеанса. Однако вы можете легко удалить файлы cookie в настройках своего браузера. Подробнее об управлении файлами cookie можно узнать в разделе 6.2.</p>
            <p>6.1.4.&emsp;Используя Платформу, вы соглашаетесь на использование файлов cookie, описанное в Политике.</p>
            <p>6.2.&emsp;Управление файлами cookie</p>
            <p style="padding: 0;">6.2.1.&emsp;Вы можете в любой момент изменить настройки файлов cookie, удалить или отклонить все файлы cookie: просто активируйте настройку вашего браузера, которая позволяет отказаться от файлов cookie. Обратите внимание, что это может привести к невозможности доступа к определенным функциям Сайта.</p>
            <p>6.2.2.&emsp;Для получения дополнительной информации об управлении файлами cookie, в том числе об отказе от них, обратитесь к настройкам своего браузера. Вы также можете отказаться от файлов cookie, которые используют Google, Facebook, Вконтакте, как указано в пункте 5.4.</p>
            <p>7.&emsp;ПЕРВЫЙ ВХОД И (ИЛИ) ВХОД ЧЕРЕЗ СОЦИАЛЬНЫЕ СЕТИ</p>
            <p>7.1.&emsp;Наш Сайт даёт вам возможность зарегистрироваться и войти в систему, используя свою учётную запись в Telegram, Вконтакте или Google. Если вы решите войти в систему, используя учётную запись социальной сети, эта социальная сеть предоставит нам ваши Персональные данные. Входя в систему с использованием учётной записи социальной сети, вы разрешаете нам собирать, хранить и использовать в соответствии с Политикой все данные, которые вы разрешили социальной сети предоставить нам. В такие данные входят: (1) «общие» Персональные данные: ваше имя и фамилия, пол, дата рождения, местоположение, имя пользователя, адрес электронной почты, номер телефона, ссылки на другие учётные записи в социальных сетях, список друзей; (2) конфиденциальные данные, такие как ваша фотография; (3) любые другие данные, которые вы решили сделать доступными. Данные, которые мы получаем от социальной сети, зависят от ваших настроек и её политики конфиденциальности. Мы будем использовать полученные данные только для целей, описанных в Политике.</p>
            <p>7.2.&emsp;При создании учётной записи для доступа и использования Сайта вы гарантируете, что предоставленная вами информация всегда является точной, актуальной и полной.</p>
            <p>7.3.&emsp;Ваша учётная запись существует, а использование Услуг осуществляется в личных некоммерческих целях, но не в интересах третьих лиц. Вы несёте единоличную ответственность за сохранение конфиденциальности вашей учётной записи и пароля, включая ограничение доступа третьим лицам к Приложению, Сайту и любым электронным средствам (например, компьютеру, планшету и т. д.), с помощью которых вы совершаете вход на Сайт. Вы принимаете на себя всю ответственность и обязательства за все действия, которые совершаются в вашей учетной записи под вашими реквизитами пользователя. Вы должны немедленно уведомить Компанию в случае, если вам стало известно или вы подозреваете о каком-либо нарушении безопасности или несанкционированном использовании вашей учётной записи.</p>
            <p>7.4.&emsp;Вы не вправе без соответствующего разрешения использовать имя пользователя, которое является именем или подразумевает имя или личность другого физического или юридического лица, использование которого неправомерно, наименование или товарный знак, какие-либо права на которые принадлежат другому физическому или юридическому лицу, а не вам. Запрещено использовать оскорбительное, вульгарное или непристойное имя пользователя. Компания оставляет за собой право отказать в обслуживании, прекратить действие учётных записей, удалить или отредактировать контент по своему усмотрению.</p>
            <p>8.&emsp;ПЕРЕДАЧА ВАШЕЙ ИНФОРМАЦИИ</p>
            <p>8.1.&emsp;Страны, в которые мы или третьи лица, с которыми мы взаимодействуем, передаем ваши данные, могут не иметь такого же законодательства о защите данных, как в вашей юрисдикции. Таким образом, в этих случаях мы принимаем разумные меры безопасности, предписанные действующим законодательством, чтобы обеспечить надлежащую защиту ваших данных при их передаче за пределы вашей юрисдикции.</p>
            <p>8.2.&emsp;Принимая Политику и предоставляя нам свои Персональные данные, вы соглашаетесь на такую передачу. Если вы не согласны на такую передачу данных, вы больше не сможете пользоваться Сайтом. Если вы являетесь резидентом Европейской экономической зоны (ЕЭЗ), мы можем передавать ваши данные за пределы ЕЭЗ в целях выполнения договора с вами (предоставления вам Услуг), так как мы предоставляем услуги по всему миру. Когда мы совершаем такую передачу данных, мы: (1) выполняем свои правовые и нормативные обязательства; (2) принимаем соответствующие меры предосторожности, такие как исполнение стандартных положений о защите данных. Мы предпримем все шаги, необходимые для обеспечения безопасной обработки ваших данных в соответствии с Политикой.</p>
            <p>8.3.&emsp;Политика применяется независимо от места, в котором мы храним или обрабатываем ваши Персональные данные.</p>
            <p>8.4.&emsp;Если мы предоставили вам (или вы выбрали) пароль, который позволяет вам получить доступ к Сайту, вы несёте ответственность за сохранение этого пароля в тайне. Пожалуйста, никому не сообщайте пароль.</p>
            <p>9.&emsp;ХРАНЕНИЕ ВАШЕЙ ИНФОРМАЦИИ</p>
            <p>9.1.&emsp;Персональная информация о Пользователях хранится в соответствии с действующим законодательством.</p>
            <p>9.2.&emsp;Мы можем использовать обезличенные (без привязки к Пользователю) данные в исследовательских или статистических целях или для улучшения качества наших Услуг. Мы вправе использовать их бессрочно без предварительного уведомления.</p>
            <p>10.&emsp;ЗАЩИТА ДАННЫХ</p>
            <p>10.1.&emsp;Мы используем соответствующие физические, электронные, управленческие и технические средства защиты, обеспечивающие безопасность всех Персональных данных, которые мы обрабатываем. Однако просим вас не забывать, что мы не можем обеспечить или гарантировать безопасность ваших данных, которые вы передаёте Сайту. Несмотря на то, что мы сделаем всё возможное для защиты ваших Персональных данных, передача Персональных данных на Сайт осуществляется на ваш страх и риск. Пожалуйста, пользуйтесь Услугами только в безопасной среде: например, используйте средства сетевой защиты, выбирайте провайдера, который шифрует трафик, и т. д. После получения Персональных данных мы следуем строгим правилам и используем средства защиты с целью предотвратить несанкционированный доступ. Тем не менее, мы не несём ответственности ни за какой ущерб, связанный с несанкционированным доступом к Персональным данным.</p>
            <p>11.&emsp;КОНФИДЕНЦИАЛЬНОСТЬ ДАННЫХ НЕСОВЕРШЕННОЛЕТНИХ</p>
            <p>11.1.&emsp;Наши Услуги предназначены для широкой аудитории и могут быть использованы несовершеннолетними. Несовершеннолетние могут получить доступ к некоторым общедоступным частям Сайта и его содержанию без предоставления нам Персональных данных. Однако несовершеннолетние, желающие получить доступ ко всему содержанию и функциональным возможностям Услуг, должны зарегистрироваться. Регистрация предполагает сбор определенных Персональных данных. Мы можем попросить вас предоставить нам информацию и документы, подтверждающие возраст. Если вы несовершеннолетний, мы можем потребовать представить нам документы, подтверждающие выход из-под родительской опеки или юридическое согласие вашего родителя или законного опекуна.</p>
            <p>11.2.&emsp;Кроме того, мы используем определенные технологии, такие как файлы cookie, для автоматического сбора информации от наших пользователей (включая несовершеннолетних) при посещении или использовании Сайта. Мы собираем, обрабатываем, храним и раскрываем данные несовершеннолетних в порядке, предусмотренном настоящей Политикой.</p>
            <p>12.&emsp;ВАШИ ПРАВА НА ЗАЩИТУ ДАННЫХ</p>
            <p>12.1.&emsp;Вы можете отозвать своё согласие на обработку ваших Персональных данных только при условии письменного уведомления Компании не менее чем за 180 дней до предполагаемой даты прекращения использования данных Компанией.</p>
            <p>12.2.&emsp;Обратите внимание: мы можем попросить вас подтвердить свою личность, прежде чем ответить на запрос, а при определенных обстоятельствах возьмём плату для покрытия наших расходов. Срок ответа составляет один месяц после получения запроса. Если обработка вашего запроса займёт больше времени, мы уведомим вас об этом. В любом случае, мы не можем продлить срок ответа более чем на два месяца после окончания первого месяца, установленного для ответа.</p>
            <p>12.3.&emsp;Если вы отпишетесь от нашей рекламной рассылки, нам по-прежнему нужно будет отправлять вам электронные письма, связанные с Услугами, необходимые для администрирования и использования вашей учётной записи.</p>
            <p>13.&emsp;АВТОМАТИЗИРОВАННОЕ ПРИНЯТИЕ РЕШЕНИЙ</p>
            <p>13.1.&emsp;Мы не используем автоматизированное принятие решений (создание профилей пользователей на основе Персональных данных и т. д.).</p>
            <p>14.&emsp;ИЗМЕНЕНИЯ В ПОЛИТИКЕ</p>
            <p>14.1.&emsp;Мы вправе в любой момент изменить Политику. Если внесём в Политику существенные изменения, то уведомим вас об этом на Сайте или по электронной почте. Мы также изменим номер редакции и дату опубликования на первой странице Политики. Любые изменения, которые мы вносим в Политику, вступают в силу с даты опубликования или после неё. Каждая новая редакция заменяет любую предыдущую редакцию Политики. Рекомендуем периодически просматривать Политику, чтобы знать, как мы защищаем вашу информацию.</p>
            <p>15.&emsp;КОНТАКТЫ</p>
            <p>15.1.&emsp;Если у вас есть вопросы, комментарии или пожелания, связанные с Политикой, пожалуйста, напишите нашему специалисту по защите данных по адресу: <a class="inside-footer-text" href="#">dpo@skyeng.eu</a>.</p>
            <p>16.&emsp;ТОЛКОВАНИЕ</p>
            <p>16.1.&emsp;Ссылки на <b>пункты</b> и <b>разделы</b> означают ссылки на пункты и разделы Политики. Выражение «<b>включая</b>» и другие подобные слова и выражения означают «включая, среди прочего».</p>
            <p>16.2.&emsp;В настоящей Политике термины употребляются в следующих значениях:</p>
            <p style="padding: 0;">16.2.1.&emsp;Термин <b>Данные об использовании</b> применяется в значении, установленном для него в пункте 2.1.2;</p>
            <p style="padding: 0;">16.2.2.&emsp;Термин <b>Данные от третьих лиц</b> применяется в значении, установленном для него в пункте 2.1.3;</p>
            <p style="padding: 0;">16.2.3.&emsp;Термин <b>Компания</b> применяется в значении, установленном для него в пункте 1.2;</p>
            <p style="padding: 0;">16.2.4.&emsp;Термин <b>мы</b> применяется в значении, установленном для него в пункте 1.2;</p>
            <p style="padding: 0;">16.2.5.&emsp;Термин <b>Персональные данные</b> применяется в значении, установленном для него в пункте 1.2;</p>
            <p style="padding: 0;">16.2.6.&emsp;Термин <b>Политика</b> применяется в значении, установленном для него в пункте 1.1;</p>
            <p style="padding: 0;">16.2.7.&emsp;Термин <b>Поставщики услуг по выставлению счетов и приёму платежей</b> применяется в значении, установленном для него в пункте 5.2.1;</p>
            <p style="padding: 0;">16.2.8.&emsp;Термин <b>Предоставленные данные</b> применяется в значении, установленном для него в пункте 2.1.1;</p>
            <p style="padding: 0;">16.2.9.&emsp;Термин <b>Сайт</b> применяется в значении, установленном для него в пункте 1.1;</p>
            <p>16.2.10.&emsp;Термин <b>Услуги</b> применяется в значении, установленном для него в пункте 1.1.</p>
            <p>17.&emsp;ИСПОЛНИТЕЛЬ</p>
            <p style="padding: 0;">&emsp;&emsp;Индивидуальный предприниматель Дмитрягина Катерина Николаевна</p>
            <p style="padding: 0;">&emsp;&emsp;353290, Россия, Краснодарский край, г. Горячий Ключ, ул. Объездная, д. 2, корп. В, кв. 1</p>
            <p style="padding: 0;">&emsp;&emsp;ИНН 9724028470</p>
            <p style="padding-bottom: 7px;">&emsp;&emsp;ОГРН 1207700431806</p>
          </div>
        </div>
    </div>
</template>

<script>
export default {
    data() {
        return {}
    },
    methods: {
        stopPropag: function(event) {
            event.stopPropagation();
        },
    },
    mounted() {
        document.title = "FullEng – Политика конфиденциальности";
    }
}
</script>

<style scoped>
.page-shadow {
    font-size: 78%;
  position: fixed;
  overflow: auto;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(255, 255, 255, 0.88);
  z-index: 920;
}

.pop-up {
  display: block;
  overflow: auto;
  width: 782px;
  height: 90%;
  margin: 3vh auto;
  color: #262626;
  background: #f7f7f7;
  padding: 20px;
  z-index: 950;
  /* font-size: 125%; */
  font-weight: normal;
  border-radius: 7px;
  text-align: justify;
  user-select: none;
}

.pop-up span.close-btn {
    float: right;
    font-weight: bold;
    font-size: 125%;
    cursor: pointer;
}

p {
    margin: 0;
    padding-bottom: 15px;
}

.footer-link {
    color: #808080;
}

.footer-link:hover {
    color: #b2b2b2;
    cursor: pointer;
    text-decoration: underline;
}

a.inside-footer-text {
  text-decoration: underline;
}

a:link {
    color: #808080;
}

a:visited {
    color: #808080;
}

a:hover {
    color: #b2b2b2;
}
</style>