<template>
    <div>
        <div class="page-shadow" @click="$store.commit('closeTermsOfUse'); $router.back()" v-if="$store.getters.getTermsOfUse">
          <div class="pop-up main" @click="stopPropag" v-if="$store.getters.getTermsOfUse">
            <span class="close-btn" @click="$store.commit('closeTermsOfUse'); $router.back()">&times;</span>
            <p style="text-align: center;"><b>Условия использования</b></p>
            <p>«01» июля 2022 года</p>
            <p style="padding: 0; text-align: center;"><b>Общие условия</b></p>
            <p style="padding: 0;">&emsp;Настоящий Интернет-ресурс <span @click="$store.commit('closeTermsOfUse')"><router-link class="inside-footer-text" to="/">https://skyeng.ru</router-link></span> (далее — «Сайт»), включающий в себя всю информацию и страницы, является собственностью <b>Индивидуального предпринимателя Дмитрягиной К. Н.</b> (далее также именуемый —  «FullEng»).
                <br />&emsp;Настоящие Условия использования (далее — «Условия») применимы ко всем пользователям и лицам, имеющим доступ к Сайту (далее — «Посетители»).
                <br />&emsp;Термины «вы», «ваш» относятся к вам, как к Посетителю, а термины «FullEng», «мы», «нас», «Компания» и «наш» относятся к компании FullEng (ИП Дмитрягина К. Н.).
                <br />&emsp;Получая доступ или пользуясь Сайтом, вы соглашаетесь с соблюдением Условий, политики конфиденциальности и другими условиями и положениями, применимыми к Сайту.
                <br />&emsp;Если вы не соглашаетесь с Условиями, политикой конфиденциальности и другими условиями и положениями, применимыми к Сайту, убедительно просим прекратить получать доступ и пользоваться Сайтом.</p>
            <p style="padding: 0; text-align: center;"><b>Пользователи и Посетители</b></p>
            <p style="padding: 0;">&emsp;После создания зарегистрированного профиля на Сайте и оплаты услуг по предоставлению доступа к курсу обучения FullEng (получению онлайн продуктов), вы становитесь Пользователем и заключаете с компанией FullEng Соглашение об оказании услуг по предоставлению доступа к курсу обучения FullEng (получению онлайн продуктов), представленное здесь: <span @click="$store.commit('closeTermsOfUse')"><router-link class="inside-footer-text" to="/offer-agreement">https://legal.skyeng.ru/doc/view/offereuaseagt</router-link></span>.
                <br />&emsp;При отказе от использования услуг, вам, как Посетителю, в соответствии с Условиями, становятся доступы определенные общедоступные материалы Сайта.
                <br />&emsp;Посетителями являются лица, не использующие наши услуги, но желающие пользоваться Сайтом.</p>
            <p style="padding: 0; text-align: center;"><b>Права и обязанности Посетителей</b></p>
            <p style="padding: 0;">&emsp;Посетители вправе просматривать и пользоваться определенными общедоступными материалами Сайта без взимания платы за личное некоммерческое использование.
                <br />&emsp;Предоставляя вам доступ к Сайту, компания FullEng не обязуется делать это или поддерживать Сайт в рабочем состоянии, и сохраняет за собой право изменить Сайт, ограничить его работу или прекратить ваш доступ к Сайту.
                <br />&emsp;Вы понимаете и соглашаетесь с тем, что мы вправе ограничить ваш доступ к Сайту по своему усмотрению и без предварительного уведомления.
                <br />&emsp;Посетители обязаны соблюдать применимое законодательство при использовании Сайта, а также положения Условий.</p>
            <p style="padding: 0; text-align: center;"><b>Посетителям запрещается:</b></p>
            <p style="padding: 0;">&emsp;–	пользоваться Сайтом и его материалами способом, нарушающим Условия или применимое законодательство;
                <br />&emsp;–	использовать Сайт и его материалы в коммерческих целях;
                <br />&emsp;–	нарушать или пытаться нарушить нормальную работу Сайта.
                <br />&emsp;Помимо прочего, Посетителям запрещено использовать вредоносное ПО или устройства с целью злонамеренного получения доступа к данным, запрещенному сбору или передаче информации путём взлома, добычи данных, кражи паролей и т. д.</p>
            <p style="padding: 0; text-align: center;"><b>Права на результаты интеллектуальной деятельности</b></p>
            <p style="padding: 0;">&emsp;Компания FullEng (и/или ее лицензиары) владеет всеми правами на Сайт, в частности всеми относящимися к нему аудио- и видеоматериалами, фотографиями, иллюстрациями, изображениями,   логотипами, текстами, информацией, материалами и любыми охраняемыми авторским правом или другим законным образом элементами Сайта, включая помимо прочего, любые авторские права, торговые знаки, патентные права и/или другие результаты интеллектуальной деятельности и/или права на них.
                <br />&emsp;Вам запрещается воспроизводить, изменять, проигрывать, демонстрировать, размещать, передавать любым третьим лицам или каким-либо другим образом пользоваться Сайтом, включая, в том числе, любые упомянутые материалы, без дополнительного письменного разрешения компании FullEng.
                <br />&emsp;Использование нашего товарного знака или любых других материалов Сайта строго запрещено, если не разрешено обратное.
                <br />&emsp;Вас известили о том, что компания FullEng будет защищать свои результаты интеллектуальной деятельности в полной мере, предусмотренной законом.</p>
            <p style="padding: 0; text-align: center;"><b>Конфиденциальность</b></p>
            <p style="padding: 0;">&emsp;Политика конфиденциальности компании FullEng доступна по ссылке: <span @click="$store.commit('closeTermsOfUse')"><router-link class="inside-footer-text" to="/privacy-policy">https://legal.skyeng.ru/doc/view/privacy-policyseagtrus</router-link></span>, и применяется к вашему доступу к пользованию Сайта.
                <br />&emsp;Компания FullEng обязана сотрудничать и соблюдать все правительственные запросы, отвечать на все судебные повестки, постановления, а также компания вправе обеспечивать неприкосновенность такой деятельности.
                <br />&emsp;Принимая во внимание этот факт, настоящим вас уведомили о том, что компания FullEng может раскрывать личную информацию о зарегистрированных пользователях и материалы, раскрытие которых государственный орган или суд сочтёт необходимым на основании письменных запросов, судебных повесток и, в том числе, постановлений.</p>
            <p style="padding: 0; text-align: center;"><b>Отказ от ответственности</b></p>
            <p style="padding: 0;">&emsp;В установленных действующим законодательством случаях, компания FullEng официально отказывается от: (1) любых прямых и косвенных гарантий и заявлений, включая гарантии товарной пригодности для какой-либо цели или отсутствия нарушения; (2) любой ответственности или обязанности относительно достоверности контента и любой информации, доступной на Сайте; (3) любой ответственности или обязанности относительно  любого  вреда,  причиненного  в  результате получения доступа к информации на Сайте.
                <br />&emsp;Сайт и Материалы предоставляются в том виде, в котором они есть и по возможности.
                <br />&emsp;Компания FullEng не гарантирует и не свидетельствует о том, что: (1) Сайт или материалы будут соответствовать вашим личным требованиям или ожиданиям; (2) Работа Сайта будет бесперебойной, своевременной, безопасной и безошибочной.</p>
            <p style="padding: 0; text-align: center;"><b>Ответственность</b></p>
            <p style="padding: 0;">&emsp;Компания FullEng ни при каких обстоятельствах не несёт ответственности за какой бы то ни было ущерб, возникший в результате пользования или неспособности пользования Сайтом, вне зависимости от того, были ли вы проинформированы о вероятности получения такого ущерба.</p>
            <p style="padding: 0; text-align: center;"><b>Ограждение от ответственности</b></p>
            <p style="padding: 0;">&emsp;Вы соглашаетесь ограждать от ответственности компанию FullEng, её дочерние компании, директоров, должностных лиц и сотрудников, а также возместить ей любые убытки, потери, а также любые издержки и расходы, в частности гонорары адвокатов, любые другие затраты на юридические услуги, прямо или косвенно возникшие вследствие вашего нарушения Условий.</p>
            <p style="padding: 0; text-align: center;"><b>Ссылки</b></p>
            <p style="padding: 0;">&emsp;Сайт может содержать загружаемый контент, а также ссылки на внешние сайты или ресурсы, предоставляемые третьими лицами.
                <br />&emsp;Такой загружаемый контент, ссылки или ресурсы предоставлены исключительно для вашего удобства.
                <br />&emsp;Компания FullEng не может контролировать и не несёт ответственность за материалы сторонних сайтов или ресурсов.
                <br />&emsp;Ответственность за весь подобный контент несёт исключительно то лицо или организация, распространяющая такой контент.
                <br />&emsp;Получая доступ к любым сторонним сайтам, ссылки на которых находятся на настоящем Сайте, вы делаете это на свой страх и риск в соответствии с условиями использования таких сайтов.</p>
            <p style="padding: 0; text-align: center;"><b>Изменения</b></p>
            <p style="padding: 0;">&emsp;Материалы, отображающиеся на Сайте, могут включать в себя технические, типографические и другие ошибки.
                <br />&emsp;Компания FullEng не гарантирует, что материалы Сайта являются достоверными, полными или актуальными.
                <br />&emsp;Компания FullEng может вносить изменения в материалы, находящиеся на Сайте, в любое время без предварительного уведомления.</p>
            <p style="padding: 0; text-align: center;"><b>Расторжение</b></p>
            <p style="padding: 0;">&emsp;Компания FullEng оставляет за собой право ограничивать или прекращать ваш доступ к Сайту путём блокировки вашего IP-адреса без уведомления или обязательства.
                <br />&emsp;Любая незаконная, мошенническая или неправомерная деятельность, нарушение интеллектуальных прав или Условий, является основанием для ограничения или прекращения вашего доступа к Сайту.</p>
            <p style="padding: 0; text-align: center;"><b>Применимое законодательство и решение споров</b></p>
            <p style="padding: 0;">&emsp;Условия	регулируются и толкуются в соответствии с законодательством Российской Федерации.
                <br />&emsp;Все разногласия и споры, возникающие из или в связи с Условиями, будут решаться путём переговоров следующим образом:
                <br />&emsp;Потерпевшая Сторона направит письменную жалобу другой Стороне по электронной почте;
                <br />&emsp;Если, в течение тридцати (30) календарных дней, потерпевшая Сторона не получит ответа или Стороны не достигнут соглашения, потерпевшая Сторона может направить иск в суд.
                <br />&emsp;Если иск предъявлен против компании FullEng, процесс будет рассматриваться по месту нахождения (по месту жительства) FullEng.</p>
            <p style="padding: 0; text-align: center;"><b>ДОСТУПНОСТЬ</b></p>
            <p style="padding: 0;">&emsp;Компания FullEng принимает разумные меры по обеспечению работоспособности и доступности Сайта.
                <br />&emsp;Однако могут быть случаи, когда доступ к Сайту может быть прерван или невозможен.
                <br />&emsp;Мы приложим все разумные усилия, чтобы минимизировать подобные нарушения, если их решение будет в наших силах.
                <br />&emsp;Вы соглашаетесь с тем, что мы не несём ответственность за любое изменение, приостановку и прекращение работы Сайта.
                <br />&emsp;Вы несёте ответственность за получение доступа к Сайту и за включенные в него платежи третьим лицам (например, услуги интернет-провайдера). Вы несёте ответственность за такие платежи.
                <br />&emsp;Вы также обязаны предоставить всё необходимое оборудование для получения доступа к Сайту.</p>
            <p style="padding: 0; text-align: center;"><b>Прочие положения</b></p>
            <p style="padding: 0;">&emsp;Компания FullEng оставляет за собой право в любое время и на своё усмотрение изменять, вносить правки, добавлять и убирать положения Условий, включая Положения о конфиденциальности.
                <br />&emsp;Условия являются обязательными для вас, и вы обязаны периодически проверять их на наличие любых изменений.
                <br />&emsp;Продолжая получать доступ или использовать Сайт, следуя всем вносимым изменениям, вы принимаете и соглашаетесь на любые такие изменения.
                <br />&emsp;Вы не можете передавать и уступать Условия и полученные в связи с ними права, как полностью, так и частично.
                <br />&emsp;Компания FullEng оставляет за собой право передавать свои права и обязанности в рамках Условий.</p>
            <p style="padding: 0; text-align: center;"><b>Исчерпывающий характер соглашения</b></p>
            <p style="padding: 0;">&emsp;Условия, положение о конфиденциальности и Соглашение об оказании услуг по предоставлению доступа к курсу обучения FullEng (получению онлайн продуктов) образуют общее соглашение между компанией FullEng и вами в отношении Сайта, и заменяет все предыдущие и настоящие устные и письменные договоренности, соглашения, заявления и гарантии в отношении Сайта.</p>
            <p style="padding: 0; text-align: center;"><b>Исполнитель</b></p>
            <p style="padding: 0;">&emsp;Индивидуальный предприниматель Дмитрягина Катерина Николаевна
                <br />&emsp;353290, Россия, Краснодарский край, г. Горячий Ключ, ул. Объездная, д. 2, корп. В, кв. 1
                <br />&emsp;ИНН 9724028470
                <br />&emsp;ОГРН 1207700431806</p>
          </div>
        </div>
    </div>
</template>

<script>
export default {
    name: 'TermsOfUse',
    data() {
        return {}
    },
    methods: {
        stopPropag: function(event) {
            event.stopPropagation();
        },
    },
    mounted() {
        document.title = "FullEng – Условия использования";
    }
}
</script>

<style scoped>
.page-shadow {
    font-size: 78%;
  position: fixed;
  overflow: auto;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(255, 255, 255, 0.88);
  z-index: 920;
}

.pop-up {
  display: block;
  overflow: auto;
  width: 782px;
  height: 90%;
  margin: 3vh auto;
  color: #262626;
  background: #f7f7f7;
  padding: 20px;
  z-index: 950;
  /* font-size: 125%; */
  font-weight: normal;
  border-radius: 7px;
  text-align: justify;
  user-select: none;
}

.pop-up span.close-btn {
    float: right;
    font-weight: bold;
    font-size: 125%;
    cursor: pointer;
}

p {
    margin: 0;
    padding-bottom: 15px;
}

.footer-link {
    color: #808080;
}

.footer-link:hover {
    color: #b2b2b2;
    cursor: pointer;
    text-decoration: underline;
}

a.inside-footer-text {
  text-decoration: underline;
}

a:link {
    color: #808080;
}

a:visited {
    color: #808080;
}

a:hover {
    color: #b2b2b2;
}
</style>