<template>
    <div>
        <div class="page-shadow" @click="$store.commit('closeTermsOfService'); $router.back()" v-if="$store.getters.getTermsOfService">
          <div class="pop-up main" @click="stopPropag" v-if="$store.getters.getTermsOfService">
            <span class="close-btn" @click="$store.commit('closeTermsOfService'); $router.back()">&times;</span>
            <p style="text-align: center;"><b>Соглашение</b>
              <br /> об оказании платных онлайн услуг (продаже онлайн продуктов) (далее — «Соглашение»)</p>
            <p style="display: flex; justify-content: space-between;"><span>Российская Федерация, г. Горячий Ключ</span>
              <span>«01» июля 2022 года</span></p>
            <p style="padding: 0;"><b>А.	Стороны:</b>
              <br /><b>Индивидуальный предприниматель Дмитрягина К. Н.</b>, ИНН 0000000000, ОГРН 0000000000000 (далее также именуемый — «<b>FullEng</b>»), и любое физическое лицо, приобретающее онлайн услуги по обучению в собственных интересах (далее — «<b>Пользователь</b>»).</p>
            <p style="padding: 0;"><b>А.1.	Оферта</b>
              <br />&emsp;1.	Соглашение является предложением (офертой) FullEng Пользователю заключить Соглашение на нижеуказанных условиях. Оферта считается направленной с момента её публикации по адресу: <span @click="$store.commit('closeTermsOfService')"><router-link class="inside-footer-text" to="/">https://skyeng.ru</router-link></span> (далее — «сайт»).</p>
            <p style="padding: 0;"><b>Б.	Акцепт</b>
              <br />&emsp;1.	Акцептом оферты считается совершение Пользователем следующих действий:
              <br />&emsp;&emsp;•	регистрация на сайте и/или
              <br />&emsp;&emsp;•	получение FullEng денежных средств в счёт оплаты онлайн услуг по предоставлению доступа к курсу обучения FullEng (получению онлайн продуктов), состоящему из текстов и/или аудио-видео-записей, разработанных FullEng (далее — «услуги»).
              <br />&emsp;2.	Оферта считается акцептованной (принятой), а Соглашение заключенным Пользователем на условиях оферты и вступившим в силу с момента регистрации Пользователя на сайте и/или в дату получения FullEng оплаты услуг. Акцепт является полным, безоговорочным и безусловным.
              <br />&emsp;3.	Пользователь проинформирован и соглашается с тем, что факт, время и дата акцепта оферты (заключения Соглашения) Пользователем определяются на основании данных FullEng.</p>
            <p style="padding: 0;"><b>Б.1.	Вступление в силу. Применение</b>
              <br />&emsp;1.	Соглашение (настоящая версия и все последующие версии Соглашения) вступает в силу для новых Пользователей в дату акцепта, для действующих Пользователей в дату публикации, указанную в левом верхнем углу настоящей версии Соглашения, если иное не предусмотрено в конкретной версии Соглашения.
              <br />&emsp;2.	Условия Соглашения (настоящей версии и всех последующих версий Соглашения) применяются к услугам, приобретенным Пользователем до даты публикации Соглашения, в дату, определяемую в соответствии с п. 1 раздела Б.1. Соглашения, если иное не предусмотрено в конкретной версии Соглашения.
              <br />&emsp;3.	В случае если Пользователь не согласен с условиями Соглашения (настоящей версией или любой из последующих версий Соглашения) он руководствуется условиями п. 2.1. раздела Г Соглашения, если иное не предусмотрено в конкретной версии Соглашения.
              <br />&emsp;4.	Условия Соглашения применяются к услугам, реализуемым на сайте, включая все его поддомены, если иное не предусмотрено Соглашением, на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет.</p>
            <p style="padding: 0;"><b>В.	Заверения и гарантии Пользователя</b>
              <br />&emsp;1.	Любой Пользователь, заключивший Соглашение, заверяет и гарантирует FullEng фактическое наличие и соблюдение следующих обстоятельств:
              <br />&emsp;1.1.	Пользователь является физическим лицом, обладающим полной правоспособностью и дееспособностью, в том числе достиг установленного законом возраста полной дееспособности, в соответствии с применимым к нему законодательством; либо
              <br />&emsp;1.2.	Пользователь является эмансипированным несовершеннолетним, либо несовершеннолетним, который получил согласие законного представителя (родителя, законного опекуна или  попечителя) на заключение Соглашения в соответствии с применимым законодательством; либо
              <br />&emsp;1.3.	Пользователь является физическим лицом законным представителем (родителем, законным опекуном или попечителем) несовершеннолетнего и заключает Соглашение от его имени, предварительно предоставив несовершеннолетнему разрешение пользоваться услугами, законный представитель принимает условия Соглашения от имени несовершеннолетнего и несёт ответственность за надлежащее использование услуг и соблюдение несовершеннолетним условий Соглашения; и
              <br />ЕСЛИ ВЫ НЕ ДАВАЛИ СВОЕМУ РЕБЁНКУ РАЗРЕШЕНИЕ, ПРОСИМ ВАС НЕМЕДЛЕННО СООБЩИТЬ ОБ ЭТОМ FULLENG (В СООТВЕТСТВИИ С П. 13.1. СОГЛАШЕНИЯ), ЧТОБЫ FULLENG МОГ ПРЕКРАТИТЬ ДОСТУП.
              <br />&emsp;1.4.	Для заключения и исполнения Пользователем Соглашения не требуется согласия или одобрения каких-либо третьих лиц.
              <br />&emsp;2.	FullEng вправе в любой момент потребовать от Пользователя предоставить информацию и документы, подтверждающие вышеуказанные заверения об обстоятельствах, а Пользователь обязуется предоставить такую информацию и документы в течение 10 (десяти) календарных дней с момента направления запроса.</p>
            <p style="padding: 0;"><b>Г.	Изменение Соглашения</b>
              <br />&emsp;1.	Соглашение в части стоимости услуг может быть изменено путем публикации FullEng новой стоимости услуг на сайте и/или в личном кабинете Пользователя, при этом стоимость предоплаченных услуг изменению не подлежит.
              <br />&emsp;1.1.	Каждый раз перед тем, как осуществить оплату услуг, Пользователь обязуется ознакомиться с условиями оплаты услуг. Оплачивая услуги, Пользователь соглашается с условиями оплаты услуг, действующими на дату осуществления платежа. В случае если Пользователь не согласен с новыми условиями оплаты услуг, он руководствуется условиями п. 2.1. раздела Г настоящей версии Соглашения.
              <br />&emsp;2.	Соглашение в части иных условий может быть изменено FullEng путём публикации FullEng новой версии Cоглашения на сайте.
              <br />&emsp;2.1.	Пользователь обязуется ознакомиться с условиями новой версии Соглашения после даты её публикации. Продолжая использовать сайт после даты публикации новой версии Соглашения, в том числе осуществляя оплату, Пользователь соглашается с условиями новой версии Соглашения. В случае если Пользователь не согласен с условиями новой версии Соглашения, Пользователь обязуется не производить оплату услуг после даты публикации новой версии Соглашения, а также прекратить использование сайта в дату окончания периода подписки. При этом Пользователь вправе направить FullEng заявление о возврате денежных средств в порядке, предусмотренном разделом 10 Соглашения. Соглашение прекращает действие в дату окончания периода подписки, либо в дату получения FullEng заявления о возврате денежных средств в зависимости от того, какая из указанных дат наступит ранее.
              <br />&emsp;3.	Пользователь проинформирован и соглашается с тем, что факт, время и дата (где это применимо): (1) регистрации Пользователя на сайте, (2) первичной либо последующей авторизации Пользователя на сайте, (3) осуществления Пользователем платежа, (4) использования Пользователем сайта; (5) публикации новой версии оферты, (6) окончания периода подписки по соответствующему курсу обучения, (7) прохождения пользователем каждого, в том числе последнего урока курса, (8) прекращения Соглашения — определяются на основании данных FullEng.</p>
            <p style="padding: 0;"><b>1.	Предмет</b>
              <br />&emsp;1.1.	FullEng оказывает Пользователю платные услуги по предоставлению доступа к курсу обучения FullEng (получению онлайн продуктов), состоящему из текстов, изображений и/или аудио-видео-записей, разработанных FullEng, а Пользователь обязуется использовать оплаченные услуги в течение периода подписки.
              <br />&emsp;1.2.	Услуги оказываются в течение периода подписки с использованием сайта, если иное не предусмотрено Соглашением на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет. Не совершение Пользователем действий по получению/использованию услуг не освобождает Пользователя от оплаты услуг в соответствии с условиями Соглашения.
              <br />&emsp;1.3.	Описание услуг, в частности предмет, по которому проводятся занятия; объём услуг (доступные к приобретению Пользователем курсы обучения, количество уроков в курсе); иные характеристики (в том числе язык, на котором написаны уроки курса); стоимость и условия оказания услуг, указаны на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;1.4.	Если иное не указано в Соглашении на сайте и/или в личном кабинете Пользователя, период подписки в отношении каждого оплаченного курса обучения включительно составляет двенадцать календарных месяцев с даты совершения платежа, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;1.5.	FullEng вправе оказывать иные услуги, описание, объём, характеристики и условия оказания которых могут быть указаны в Соглашении, на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;1.6.	FullEng вправе привлекать любых физических и юридических лиц для обеспечения своевременного и качественного оказания услуг по Соглашению.</p>
            <p style="padding: 0;"><b>2.	Расчёты</b>
              <br />&emsp;2.1.	Услуги являются платными. Если иное не предусмотрено на сайте и/или в личном кабинете Пользователя, стоимость услуг (конкретного курса занятий) указана на сайте и может быть доступна Пользователю после регистрации на сайте, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;2.2.	Пользователь производит оплату в порядке 100% (сто) процентной предоплаты, в безналичной форме, с помощью одного из электронных платежных сервисов, доступных на сайте. Если иные условия оплаты, в частности порядок оплаты, предусмотрены на сайте и/или в личном кабинете Пользователя, Пользователь вправе оплатить услуги на основании таких условий, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;2.3.	Услуги могут быть оплачены: (1) частично, со скидкой, полученной Пользователем результате участия в маркетинговых мероприятиях (рекламных акциях); (2) частично или полностью бонусными баллами, при наличии бонусных баллов у Пользователя.
              <br />&emsp;2.4.	Обязательства Пользователя по оплате считаются исполненными с момента зачисления денежных средств на расчетный счёт FullEng в полном объёме. Дата и время зачисления денежных средств на расчетный счёт FullEng, а также дата и время частичной или полной оплаты услуг бонусными баллами определяются на основании данных FullEng.
              <br />&emsp;2.5.	Каждый оплаченный курс обучения предоставляет Пользователю право просматривать входящие в него уроки в пределах периода подписки.
              <br />&emsp;2.6.	Пользователь несёт единоличную ответственность за корректность осуществляемых платежей и уплату применимых налогов.
              <br />&emsp;2.7.	Платежи за услуги FullEng обрабатывает компания, действующая на основании договора с FullEng (далее – «Процессинговый центр»). Все права и обязанности, возникающие в процессе расчётов, возникают непосредственно между Процессинговым центром и плательщиком.
              <br />&emsp;2.8.	FullEng не обрабатывает персональные данные плательщиков, предоставленные в связи с проведением Процессинговым центром расчётов по платежам. FullEng не хранит реквизиты банковских карт на своих ресурсах, в том числе серверах или облачных хранилищах.
              <br />&emsp;2.9.	Факт оплаты Пользователем конкретного курса обучения подтверждается выставленным FullEng инвойсом.</p>
            <p style="padding: 0;"><b>3.	Порядок оказания услуг (предоставления доступа к онлайн продуктам)</b>
              <br />&emsp;3.1.	Доступ ко всем курсам обучения (онлайн продуктам) предоставляется на сайте FullEng.
              <br />&emsp;3.2.	Конкретные услуги (онлайн продукты), оказываемые (реализуемые) Пользователю, определяются информацией в рамках ресурсов сайта FullEng.
              <br />&emsp;3.3.	После поступления оплаты FullEng предоставляет Клиенту доступ к материалам услуг (онлайн продукту). Доступ к курсам обучения является временным, срок предоставления услуги указывается на сайте FullEng.
              <br />&emsp;3.4.	Пользователь самостоятельно выбирает даты и время, когда он может воспользоваться материалами услуг (онлайн продуктов) в пределах срока доступа, указанного FullEng.
              <br />&emsp;3.5.	Услуги по предоставлению доступа к курсу обучения (онлайн продуктам) предоставляются в соответствии и на основании права Российской Федерации, в том числе, принципов и норм международного права, являющихся составной частью российской правовой системы, а также сложившейся правоприменительной практики.
              <br />&emsp;3.6.	Услуги по предоставлению доступа к курсу обучения (онлайн продуктам) предоставляются непосредственно Пользователю и только ему.
              <br />&emsp;3.7.	Формат предоставления Услуг (онлайн продуктов) во всех случаях определяется FullEng.
              <br />&emsp;3.8.	Предоставление услуг FullEng может быть приостановлено в связи с производством необходимых ремонтных и профилактических работ, а также в случаях, установленных законодательством Российской Федерации, о чём Пользователь уведомляется в порядке, утвержденном FullEng, через личный кабинет.
              <br />&emsp;3.9.	Стороны установили, что услуги считаются оказанными (выполненными) Исполнителем надлежащим образом и принятыми Пользователем с момента предоставления Пользователю доступа к материалам услуг на сайте FullEng. Возврат денежных средств после предоставления Пользователю доступа к материалам услуг не осуществляется, за исключением случая, предусмотренного п. 10.5. Соглашения.
              <br />&emsp;3.10.	По окончании периода подписки в случае использования Пользователем оплаченных услуг в полном объёме FullEng может предоставлять электронный сертификат. Сертификат предоставляется путём его размещения в личном кабинете Пользователя либо путем направления на адрес электронной почты, указанный Пользователем при регистрации на сайте. FullEng не гарантирует, что Пользователь в совершенстве освоит предмет на каком-либо уровне: это зависит от времени, затрачиваемого на изучение предмета, способностей Пользователя и приложенных усилий (включая прослушивание учебных материалов, а также иных обстоятельств). Указанный сертификат выдается для справочных целей и оценка уровня Пользователя, сделанная FullEng, может отличаться от той, что будет сделана третьими лицами.
              <br />&emsp;3.11.	Пользователь обязуется: (1) использовать сайт, личный кабинет Пользователя на сайте самостоятельно без привлечения третьих лиц; (2) проходить занятия самостоятельно, присутствие третьих лиц при проведении занятий запрещено.
              <br />&emsp;3.12.	Пользователь проинформирован и соглашается с тем, что: (1) его домашние задания могут быть полностью либо частично проверены и/или оценены с использованием средств автоматической проверки; (2) в ходе занятий Пользователю могут предлагаться задания, относящиеся к разным уровням владения предметом в целях отработки конкретных знаний и навыков; (3) факт, дата и время начала и окончания занятия, определяются на основании данных FullEng.
              <br />&emsp;3.13.	Иные виды услуг проводятся в соответствии с условиями Соглашения с учётом особенностей, указанных на сайте и/или в личном кабинете Пользователя, при этом данные личного кабина Пользователя имеют приоритет.</p>
            <p style="padding: 0;"><b>4.	Технические требования</b>
              <br />&emsp;4.1.	Пользователь несёт ответственность за соблюдение минимальных технических требований при получении услуг и за организацию рабочего места перед получением услуг. FullEng не несёт ответственности за непредоставление услуг или их ненадлежащее качество, если причиной стало отсутствие необходимого программного обеспечения или технические проблемы с подключением к Интернету.
              <br />&emsp;4.2.	Минимальные системные требования для ПК:
              <br />&emsp;&emsp;•	Операционная система: Windows 7/8/8.1/10, macOS 10.15 или новее;
              <br />&emsp;&emsp;•	Браузер: Google Chrome/ Yandex Browser/ Opera/ Mozilla Firefox/ Safari/ Edge последней стабильной версии;
              <br />&emsp;&emsp;•	Оперативная память: 4 ГБ или больше;
              <br />&emsp;&emsp;•	Процессор: двухъядерный @ 2 ГГц или мощнее;
              <br />&emsp;&emsp;•	Интернет-соединение: от 5 Мбит/сек;
              <br />&emsp;4.3.	Рекомендованные системные требования для ПК:
              <br />&emsp;&emsp;•	Операционная система: Windows 10, macOS 10.15 и новее;
              <br />&emsp;&emsp;•	Браузер: Google Chrome/ Yandex Browser/ Opera/ Edge последней стабильной версии;
              <br />&emsp;&emsp;•	Оперативная память: 6 ГБ или больше;
              <br />&emsp;&emsp;•	Процессор: четырёхъядерный @ 2,5 ГГц или мощнее;
              <br />&emsp;&emsp;•	Интернет-соединение: от 10 Мбит/сек;
              <br />&emsp;4.4.	Минимальные системные требования для мобильных устройств (смартфон/планшет):
              <br />&emsp;&emsp;•	Версия OS: Android 9, iOS 13.3 или новее;
              <br />&emsp;&emsp;•	Браузеры: актуальная версия Google Chrome или Safari, для iOS до 14.3 только Safari;
              <br />&emsp;&emsp;•	Оперативная память: 3 ГБ или больше;
              <br />&emsp;&emsp;•	Процессор: 2 ГГц (4-х ядерный) или мощнее;
              <br />&emsp;&emsp;•	Интернет-соединение: от 5 Мбит/сек.
              <br />&emsp;4.5.	Рекомендуемые системные требования для мобильных устройств (смартфон/планшет):
              <br />&emsp;&emsp;•	Версия OS: Android, iOS последней стабильной версии;
              <br />&emsp;&emsp;•	Браузеры: актуальная версия Chrome или Safari;
              <br />&emsp;&emsp;•	Оперативная память: 4 ГБ или больше;
              <br />&emsp;&emsp;•	Процессор: 2.2 ГГц (4-х ядерный) или мощнее;
              <br />&emsp;&emsp;•	Интернет-соединение: от 10 Мбит/сек.
              <br />&emsp;4.6.	Организация рабочего места: закрыть все программы, которые могут занять большую часть интернет-канала (например, файлообменники).</p>
            <p style="padding: 0;"><b>5.	Ответственность</b>
              <br />&emsp;5.1.	Стороны несут ответственность за невыполнение, либо ненадлежащее исполнение обязательств по Соглашению в соответствии с применимым законодательством и условиями Соглашения.
              <br />&emsp;5.2.	Пользователь несёт ответственность за достоверность, актуальность, полноту и соответствие применимому законодательству предоставленных им в рамках Соглашения информации, документов, в том числе данных, предоставленных при регистрации на сайте, а также за отсутствие претензий третьих лиц в отношении такой информации и/или документов. Пользователь соглашается с тем, что действия, совершенные на сайте после заключения Соглашения, признаются действиями Пользователя. FullEng не несёт ответственности  за  ущерб,  причиненный  в  результате несанкционированного доступа к сайту с использованием данных Пользователя.
              <br />&emsp;5.3.	FullEng не несёт ответственности за неоказание и/или ненадлежащее оказание услуг в случае нарушения условий Соглашения Пользователем. В случае нарушения Пользователем условий Соглашения услуги подлежат оплате в полном объёме.
              <br />&emsp;5.4.	FullEng не несёт ответственности за несоответствие услуг и функциональных возможностей сайта ожиданиям Пользователя, за его субъективную оценку, такое несоответствие ожиданиям и/или отрицательная субъективная оценка не являются основаниями считать услуги оказанными не качественно и/или не в согласованном объёме, также, как и не является таким основанием мнение третьих лиц (в том числе сотрудников государственных органов) отличное от мнения Skyeng (его сотрудников и/или партнеров).
              <br />&emsp;5.5.	FullEng не несёт ответственности за несоответствие функциональных возможностей сайта ожиданиям Пользователя, связанным с результативностью/эффективностью использования сайта, за пригодность сайта для оказания услуг, не гарантирует соответствие сайта неким специальным требованиям Пользователя или возможность настройки (изменения) разделов сайта, в соответствии с предпочтениями Пользователя. FullEng также не гарантирует, что сайт полностью свободны от дефектов и ошибок, и должны функционировать бесперебойно.
              <br />&emsp;5.6.	FullEng не несёт ответственности за перерывы в работе сайта (в т. ч. аварийные, профилактические), за недостаточное качество или скорость предоставления данных, за полную или частичную утрату каких-либо данных, размещенных на сайте, или за причинение любых иных убытков, которые возникли или могут возникнуть у Пользователя при пользовании сайта. FullEng прилагает все разумные усилия, предотвращающие сбои и неполадки в работе сайта, однако не гарантирует его бесперебойную работу, не несёт ответственности за неё и не обязуется уведомлять Пользователя о сбоях в работе сайта.
              <br />&emsp;5.7.	FullEng не несёт ответственности за возможные ошибки, сбои, перерывы в работе сайта, в том числе, если подобные ошибки, сбои или перерывы вызваны проведением планового обслуживания или: (1) перебоями в электропитании, глобальными перебоями в работе национального или международного сегментов сети Интернет, сбоями систем маршрутизации; (2) сбоями в распределенной системе доменных имен; (3) сбоями, вызванными попытками и/или несанкционированным администрированием третьими лицами сайта или DoS-атаками; (4) вредоносным программным обеспечением; иными причинами, не зависящими от FullEng.
              <br />&emsp;5.8.	FullEng не несёт ответственности за невозможность воспользоваться услугой в связи с неудовлетворительным качеством каналов связи, линий коммуникаций, неисправности оборудования Пользователя, неоплатой Пользователем услуг третьих лиц (связь, интернет), необходимых для получения Пользователем услуг по Соглашению.
              <br />&emsp;5.9.	FullEng не несёт ответственность за нарушение интеллектуальных прав, а равно иную ответственность за распространение информации/материалов/контента, произошедшее в результате размещения (публикации) на сайте какого-либо контента, в связи с тем, что FullEng: не является инициатором подобного размещения; не определяет конкретного получателя контента; не изменяет контент, за исключением изменений, осуществляемых FullEng для обеспечения технологического процесса размещения контента; на момент размещения контента на сайте и в течение периода его размещения на сайте (если не были получены соответствующие претензии или требования третьих лиц в отношении размещенной информации) не осведомлена о том, что использование соответствующих результатов интеллектуальной деятельности или средств индивидуализации лицом, инициировавшим размещение материала, содержащего соответствующие результат интеллектуальной деятельности или средство индивидуализации, является неправомерным и/или о том, что размещение указанной информации нарушает иные права и/или законные интересы третьих лиц.
              <br />&emsp;5.10.	FullEng не несёт ответственности в отношении информационного наполнения интернет-страниц, размещённых на других информационных ресурсах, ссылки на которые могут быть размещены Пользователем на сайте.
              <br />&emsp;5.11.	Размер ответственности FullEng в связи с неисполнением/ненадлежащим исполнением Соглашения не может превышать стоимость последнего оплаченного Пользователем курса обучения. 
              <br />&emsp;5.12.	Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по Соглашению, если это невыполнение является следствием обстоятельств непреодолимой силы (форс–мажора), то есть чрезвычайных и непредотвратимых при данных условиях обстоятельств, возникших после заключения Соглашения, которые Стороны не могли ни предвидеть, ни предотвратить разумными действиями. К таким обстоятельствам относятся: наводнение, землетрясение, иные стихийные природные, техногенные катастрофы, войны, военные действия, акты терроризма, решения и действия органов государственной власти и другие обстоятельства, находящиеся вне разумного контроля любой из Сторон. Факт наступления обстоятельств непреодолимой силы и их продолжительность должны подтверждаться документами, выданными соответствующими компетентными государственными органами или организациями.</p>
            <p style="padding: 0;"><b>6.	Интеллектуальная собственность</b>
              <br />&emsp;6.1.	FullEng принадлежат права на сайт, в том числе, права на любые входящие в их состав результаты интеллектуальной деятельности, включая программный код, размещённые на сайте произведения дизайна, тексты, средства индивидуализации (фирменное наименование, товарные  знаки, знаки обслуживания, коммерческие обозначения), с учётом условий, предусмотренных настоящим разделом Соглашения.
              <br />&emsp;6.2.	Предоставление Пользователю доступа к сайту осуществляется исключительно в целях надлежащего оказания услуг по Соглашению и не предусматривает передачу каких-либо прав на сайт и/или его компоненты. Доступ прекращается (ограничивается) на условиях настоящего Соглашения.
              <br />&emsp;6.3.	Пользователь не вправе использовать размещённые на сайте результаты интеллектуальной деятельности (включая, но не ограничиваясь: текст, элементы дизайна, графические изображения, а также программный код сайта, какой-либо контент сайта) без предварительного письменного согласия FullEng (в том числе, но не ограничиваясь, воспроизводить, копировать, перерабатывать, распространять в любом виде).
              <br />&emsp;6.4.	Сайт, все его элементы, предоставляются в состоянии «как есть» и «как доступно». Пользователь не вправе требовать внесения каких-либо изменений в сайт. FullEng не гарантирует доступность сайта в любой момент.
              <br />&emsp;6.5.	Использование сайта осуществляется Пользователем исключительно под свою ответственность и на собственный риск. FullEng не гарантирует бесперебойное функционирования сайта и не несёт ответственности за вред, причиненный Пользователю в результате использования сайта. FullEng не несёт ответственности за риск наступления неблагоприятных последствий, которые наступят или могут наступить в результате несоответствия используемого Пользователем оборудования, иного программного обеспечения или каналов связи установленным требованиям по защите персональных данных от несанкционированного (противоправного) посягательства третьих лиц.
              <br />&emsp;6.6.	В случае если в процессе оказания услуг Пользователем на сайте будут размещены какие-либо материалы в текстовой и/или графической и/или аудиовизуальной и/или любой иной форме (далее — материалы), Пользователь предоставляет FullEng право использовать такие материалы без оплаты на территории всего мира сроком на 30 (тридцать) лет с даты размещения следующими способами: распространение, воспроизведение материалов как полностью, так и любых их фрагментов, в том числе путем размещения на сайте и иных интернет-ресурсах; переработка материалов; доведение материалов до всеобщего сведения. FullEng не обязан предоставлять Пользователю отчёты об использовании материалов. Ответственность за содержание материалов несёт Пользователь.
              <br />&emsp;6.7.	Пользователь разрешает: (1) использовать материалы без указания своего имени (право на анонимное использование); (2) вносить в материалы изменения, сокращения и дополнения, снабжать материалы при их использовании иллюстрациями, предисловием, послесловием, комментариями или какими бы то ни было пояснениями; (3) обнародовать материалы, то есть право осуществить действие или дать согласие на осуществление действия, которое впервые делает материалы доступным для всеобщего сведения путем их опубликования, публичного показа, публичного исполнения, сообщения в эфир или по кабелю либо любым другим способом.
              <br />&emsp;6.8.	Размещая на сайте или направляя на сайт в целях размещения контент, Пользователь заверяет и гарантирует, а также обязуется постоянно обеспечивать в отношении такого контента соблюдение всех следующих требований: (1) принадлежность исключительного права на контент и любые элементы контента Пользователю, либо Пользователь обладает лицензией, предоставляющей право использовать и разрешать иным лицам использовать контент в объёме и способами, предусмотренными настоящим разделом Соглашения; (2) если контент включает какие-либо фирменные и иные наименования, товарные знаки, имена, изображения или охраняемую законом символику иных лиц, Пользователем получены все необходимые согласия на использование таких объектов в объёме и способами, предусмотренными настоящим разделом Соглашения; (3) контент не умаляет чести, достоинства и/или деловой репутации каких-либо третьих лиц; (4) контент и его использование FullEng в объёме и способами, указанными в настоящем разделе, не нарушает какие-либо иные права и законные интересы третьих лиц; (5) контент не содержит информации, ссылок, материалов, которые нарушают исключительные права третьих лиц или распространение которых иным образом нарушает применимое законодательство.
              <br />&emsp;6.9.	В случае предъявления к FullEng каких-либо претензий и/или исков со стороны третьих лиц в связи с возможным нарушением предоставленных прав, Пользователь обязуется самостоятельно урегулировать такие претензии полностью, освободив FullEng от ответственности, в том числе от любых выплат в пользу таких лиц и возместить FullEng убытки.</p>
            <p style="padding: 0;"><b>7.	Данные Пользователя</b>
              <br />&emsp;7.1.	Пользователь обязуется предоставлять FullEng все данные, запрашиваемые сайтом и/или FullEng, которые необходимы для оказания услуг.
              <br />&emsp;7.2.	Предоставляя данные FullEng, в том числе при регистрации на сайте, Пользователь соглашается на обработку предоставленных данных в соответствии с Политикой конфиденциальности, размещенной по ссылке: <span @click="$store.commit('closeTermsOfService')"><router-link class="inside-footer-text" to="/privacy-policy">https://legal.skyeng.ru/doc/view/privacy-policyseagtrus</router-link></span>, являющейся неотъемлемой частью Соглашения.
              <br />&emsp;7.3.	Пользователь соглашается с тем, что FullEng вправе записывать аудио и видео во время общения с  Пользователем с целью контроля качества и повышения качества обслуживания.
              <br />&emsp;7.4.	FullEng обязуется не разглашать конфиденциальную информацию, предоставленную Пользователем в связи с выполнением Соглашения (за исключением общедоступной информации   или информации, предоставленной Пользователем при регистрации на сайте), третьим лицам без предварительного согласия Пользователя.
              <br />&emsp;7.5.	FullEng вправе использовать электронную почту, номер телефона, а также другие данные, предоставленные Пользователем, в частности при регистрации на сайте, для отправки Пользователю информации и рекламных материалов, в том числе для информирования Пользователя о деятельности компании FullEng и о ходе исполнения Соглашения.</p>
            <p style="padding: 0;"><b>8.	Конфиденциальность</b>
              <br />&emsp;8.1.	Пользователь обязуется не разглашать конфиденциальную информацию и иные данные, предоставленные FullEng в ходе исполнения Соглашения (за исключением общедоступной информации), третьим лицам без предварительного письменного согласия FullEng.</p>
            <p style="padding: 0;"><b>9.	Расторжение Соглашения</b>
              <br />&emsp;9.1.	Соглашение может быть расторгнуто по инициативе Пользователя в одностороннем порядке путём направления FullEng соответствующего письменного мотивированного уведомления по адресу, указанному в разделе А. Соглашения. Соглашения считается прекращенным в дату получения FullEng соответствующего уведомления.
              <br />&emsp;9.2.	Возврат денежных средств осуществляется в порядке, предусмотренном разделом 10 Соглашения.
              <br />&emsp;9.3.	В случае если Пользователь решит возобновить получение услуг после расторжения Соглашения, стоимость услуг определяется в соответствии с ценами, действующими в момент возобновления. FullEng вправе сохранить для Пользователя цены, действующие до даты расторжения Соглашения.
              <br />&emsp;9.4.	Пользователь проинформирован и соглашается с тем, что дата и время получения FullEng уведомления о расторжении Соглашения определяются на основании данных FullEng.</p>
            <p style="padding: 0;"><b>10.	Возврат денежных средств</b>
              <br />&emsp;10.1.	Возврат денежных средств осуществляется по заявлению Пользователя, составленному по форме FullEng. Форма заявления может быть доступна на сайте и/или в личном кабинете Пользователя. В случае, когда форма заявления не доступна на сайте и/или в личном кабинете Пользователя, Пользователь запрашивает у FullEng форму заявления на возврат денежных средств путём направления соответствующего сообщения в личном кабинете Пользователя. Заполненное по форме FullEng заявление (скан-копию) на возврат денежных средств Пользователь направляет FullEng на адрес электронной почты: <a class="inside-footer-text" href="#">refund@skyeng.ru</a>. К заявлению (скан-копии) на возврат денежных средств должны быть приложены копии документов: (1) удостоверяющих личность, а также (2) указанные в форме заявления.
              <br />&emsp;10.2.	FullEng рассматривает заявление в течение 30 (тридцати) рабочих дней с даты его получения и в случае отсутствия замечаний осуществляет возврат денежных средств в размере, рассчитанном в соответствии с условиями Соглашения. FullEng вправе запросить дополнительные документы и/или информацию, необходимые для осуществления возврата денежных средств, в этом случае возврат осуществляется в течение 30 (тридцати) календарных дней после получения FullEng таких документов и/или информации.
              <br />&emsp;10.3.	Заявление на возврат денежных средств приравнивается к одностороннему отказу Пользователя от оказания услуг в части курса обучения, в отношении которого Пользователем запрашивается возврат денежных средств. В этом случае Соглашение считается прекращённым полностью либо в соответствующей части в дату получения FullEng соответствующего заявления на возврат денежных средств.
              <br />&emsp;10.4. Возврат денежных средств после предоставления Пользователю доступа к материалам услуг не осуществляется, за исключением случая, предусмотренного п. 10.5. Соглашения.
              <br />&emsp;10.5.	Денежные средства подлежат возврату в полном объёме в следующих случаях:
              <br />&emsp;10.5.1. FullEng получил заявление Пользователя о возврате денежных средств, в порядке, предусмотренном разделом 10 Соглашения, при соблюдении одновременно двух условий: (1) заявление получено в течение 14 календарных дней с момента предоставления Пользователю доступа к материалам услуг, в порядке, предусмотренном разделом 3 Соглашения, и (2) Пользователем фактически пройдено не более 2 (двух) уроков курса обучения по данным FullEng.
              <br />&emsp;10.6.	FullEng вправе удержать из суммы денежных средств, подлежащей возврату Пользователю, расходы на обработку платежей.
              <br />&emsp;10.7.	Услуги, фактически не оплаченные Пользователем, полученные последним, в частности в результате участия в маркетинговых мероприятиях (рекламных акциях), включая бонусные (дополнительные) услуги, а также бонусные баллы, не участвуют в расчёте суммы денежных средств, подлежащей возврату Пользователю.
              <br />&emsp;10.8.	Пользователь проинформирован и соглашается с тем, что дата и время получения FullEng заявления о возврате денежных средств определяется на основании данных FullEng.</p>
            <p style="padding: 0;"><b>11.	Регулирующее законодательство. Порядок разрешения споров</b>
              <br />&emsp;11.1.	Настоящее Соглашение регулируется и толкуется в соответствии с законодательством Российской Федерации.
              <br />&emsp;11.2.	Все споры или разногласия, возникающие между Сторонами по Соглашению или в связи с ним, разрешаются путём переговоров.
              <br />&emsp;11.3.	Потерпевшая Сторона вправе направить Стороне претензию. В случае если в течение 1 (одного) календарного месяца с даты получения претензии Стороной, потерпевшая Сторона не получит ответа на претензию или Стороны не придут к соглашению, то их разногласия разрешаются в судебном порядке согласно действующему законодательству Российской Федерации.
              <br />&emsp;11.4.	Претензия и ответ на претензию могут быть направлены по электронной почте.
              <br />&emsp;11.5.	Стороны соглашаются, что, в том случае, когда по закону конкретный спор должен рассматриваться в суде общей юрисдикции, он будет рассматриваться по месту нахождения (по месту жительства) FullEng.</p>
            <p style="padding: 0;"><b>12.	Прочие положения</b>
              <br />&emsp;12.1.	В случае если какое-либо положение Соглашения признаётся недействительным, ничтожным или неисполнимым, все прочие положения Соглашения остаются действительными и подлежат исполнению в полном объёме.
              <br />&emsp;12.2.	FullEng вправе переуступить настоящее Соглашение третьим лицам, Пользователь соглашается с такой переуступкой.
              <br />&emsp;12.3.	FullEng вправе отказать в оказании услуг, приостановить и/или прекратить доступ Пользователя к сайту в случае:
              <br />&emsp;&emsp;•	прекращения Соглашения;
              <br />&emsp;&emsp;•	окончания периода подписки;
              <br />&emsp;&emsp;•	полного использования Пользователем оплаченных услуг;
              <br />&emsp;&emsp;•	отзыва Пользователем согласия на обработку предоставленных данных;
              <br />&emsp;&emsp;•	нарушения Пользователем условий Соглашения;
              <br />&emsp;&emsp;•	если предусмотрено Соглашением.
              <br />&emsp;12.4.	Бонусные баллы, получение которых Пользователем не связано с приобретением Пользователем услуг, в частности в результате участия в маркетинговых мероприятиях (рекламных акциях), или бонусные баллы, получение которых Пользователем связано с приобретением Пользователем услуг, в частности с передачей Пользователю подарочного сертификата, могут быть использованы Пользователем в счёт частичной или полной оплаты услуг. Часть стоимости услуг, которая может быть оплачена бонусными баллами, определяется на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет. Условия получения/приобретения Пользователем бонусных баллов, могут быть указаны на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет.
              <br />&emsp;12.5.	Курсы обучения, не пройденные Пользователем в течение периода подписки, в рамках оплаченного Пользователем курса обучения считаются не пройденными по обстоятельствам, связанным с Пользователем, не переносятся, не компенсируются, подлежат оплате в полном объёме, денежные средства в отношении таких курсов обучения не возвращаются, услуги в отношении таких курсов обучения считаются оказанными надлежащим образом (в полном объёме и в срок) и принятыми Пользователем без возражений и подлежащими оплате. В случае если Пользователь не воспользовался подарочным сертификатом в срок, указанный в сертификате, к курсам обучения по такому сертификату применяются плавила настоящего пункта.
              <br />&emsp;12.6.	Наименование и перечень количественных показателей оказания услуг, в частности объём, период оказания, стоимость услуг определяются и рассчитываются FullEng самостоятельно на основании собственных данных FullEng и могут быть доступны Пользователю полностью либо частично в Личном кабинете Пользователя. Стороны принимают собственные данные FullEng в качестве единственного достоверного источника данных, определяющего количественные показатели, объём, период, стоимость, а также иные характеристики оказанных услуг. Если Пользователь не представил возражений в отношении оказанных услуг в соответствии с п. 10.5. Соглашения, услуги считаются оказанными надлежащим образом (в полном объёме и в срок), принятыми Пользователем без возражений и подлежащими оплате.
              <br />&emsp;12.7.	Факт, время и дата получения и направления FullEng материалов, документов и информации, претензий (ответов на претензии), уведомлений, запросов иных сообщений от Пользователя либо Пользователю по Соглашению, а также факт (наличия/отсутствие), время и дата любых иных фактических обстоятельств, связанных с оказанием услуг по Соглашению определяются на основании данных FullEng, если иные данные очевидно не свидетельствуют об обратном.
              <br />&emsp;12.8.	Услуги, предусмотренные Соглашением, могут быть приобретены Пользователем в случае, если они доступны для приобретения Пользователем на сайте и/или в личном кабинете Пользователя. FullEng не гарантирует наличие и/или доступность к приобретению Пользователем всех и/или любого (каждого) из предусмотренных Соглашением услуг (вида услуг) на сайте и/или в личном кабинете Пользователя.
              <br />&emsp;12.9.	Соглашение не предусматривает предоставление Пользователю прав использования сайта, а также передачи (отчуждения) Пользователю исключительных права на сайт. Доступ к сайту предоставляется Пользователю исключительно в целях оказания услуг по Соглашению.
              <br />&emsp;12.10.	Условия 3, 4 разделов Соглашения применяются, если иное не указано на сайте и/или в личном кабинете Пользователя, при этом данные личного кабинета Пользователя имеют приоритет.</p>
            <p style="padding-bottom: 7px;"><b>13.	Контакты и реквизиты</b>
              <br />&emsp;13.1.	Контакты для связи: <span @click="$store.commit('closeTermsOfService')"><router-link class="inside-footer-text" to="/contacts">https://skyeng.ru/contacts</router-link></span>.
              <br />&emsp;13.2.	Исполнитель:
              <br />&emsp;&emsp;&emsp;Индивидуальный предприниматель Дмитрягина Катерина Николаевна
              <br />&emsp;&emsp;&emsp;353290, Россия, Краснодарский край, г. Горячий Ключ, ул. Объездная, д. 2, корп. В, кв. 1
              <br />&emsp;&emsp;&emsp;ИНН 0000000000
              <br />&emsp;&emsp;&emsp;ОГРН 0000000000000
              <br />&emsp;13.3.	Банковские реквизиты:
              <br />&emsp;&emsp;&emsp;р/с 00000000000000000000
              <br />&emsp;&emsp;&emsp;Банк АО «Тинькофф Банк»
              <br />&emsp;&emsp;&emsp;ИНН банка 0000000000
              <br />&emsp;&emsp;&emsp;БИК банка 000000000
              <br />&emsp;&emsp;&emsp;к/с банка 00000000000000000000</p>
          </div>
        </div>
    </div>
</template>

<script>
export default {
  name: 'TermsOfService',
    data() {
        return {}
    },
    methods: {
        stopPropag: function(event) {
            event.stopPropagation();
        },
    },
    mounted() {
      document.title = "FullEng – Пользовательское соглашение";
    }
}
</script>

<style scoped>
.page-shadow {
    font-size: 78%;
  position: fixed;
  overflow: auto;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(255, 255, 255, 0.88);
  z-index: 920;
}

.pop-up {
  display: block;
  overflow: auto;
  width: 782px;
  height: 90%;
  margin: 3vh auto;
  color: #262626;
  background: #f7f7f7;
  padding: 20px;
  z-index: 950;
  /* font-size: 125%; */
  font-weight: normal;
  border-radius: 7px;
  text-align: justify;
  user-select: none;
}

.pop-up span.close-btn {
    float: right;
    font-weight: bold;
    font-size: 125%;
    cursor: pointer;
}

p {
    margin: 0;
    padding-bottom: 15px;
}

.footer-link {
    color: #808080;
}

.footer-link:hover {
    color: #b2b2b2;
    cursor: pointer;
    text-decoration: underline;
}

a.inside-footer-text {
  text-decoration: underline;
}

a:link {
    color: #808080;
}

a:visited {
    color: #808080;
}

a:hover {
    color: #b2b2b2;
}
</style>